app/Controllers/Home.php

SELECT *
FROM `livres`
---
    public function index(): string
    {
        $model = new UserModel();
        $data['livres'] = $model->findAll();

SELECT *
FROM `livres`
---
    public function home(): string
    {
        $model = new UserModel();
        $modelAdmin = new AdminModel();
        // $dataAdmin['user'] = $modelAdmin->find($);
        $dataLivre['livres'] = $model->findAll();

INSERT INTO `client` (`livre`, `nom`, `adresse`, `tel`, `date_emprunt`) VALUES ('Lova n\'komabria', 'lp^l', '	koop', ',;^;', '2024-09-13')
UPDATE `livres` SET `disponibilite` = 0
WHERE `livres`.`id` IN ('0000000025')
---
    public function AddClient()
    {
        $model = new ClientModel();
        $modelLivre = new UserModel();
        $titreLivre = $this->request->getPost('book');
        $dataLivre = $modelLivre->where('titre', $titreLivre)->first();
        if ($dataLivre) {
            // Enregistrer les informations du client
            $model->save([
                'livre' => $titreLivre,
                'nom' => $this->request->getPost('nom'),
                'adresse' => $this->request->getPost('adresse'),
                'tel' => $this->request->getPost('tel'),
                'date_emprunt' => $this->request->getPost('dateEmprunt'),
            ]);

            // Mettre à jour la disponibilité du livre
            $modelLivre->update($dataLivre['id'], [
                'disponibilite' => 0
            ]);

SELECT *
FROM `client`
---
    public function listeClient()
    {
        $model = new ClientModel();
        $data['client'] = $model->findAll();

SELECT *
FROM `client`
WHERE `client`.`id` = '0000000055'
UPDATE `livres` SET `disponibilite` = 1
WHERE `livres`.`id` IN ('0000000025')
DELETE FROM `client`
WHERE `id` IN ('0000000055')
SELECT *
FROM `clientclean`
---
    public function RendreLivre($ids){
        $modelClient = new ClientModel();
        $modelLivre = new UserModel();
        $modelCleanClient = new CleanClientModel();

        list($idClient, $titreLivre) = explode('-', $ids);

        $dataLivre = $modelLivre->where('titre', $titreLivre)->first();
        $dataClient = $modelClient->find($idClient);

        $modelLivre->update($dataLivre['id'], [
            'disponibilite' => 1
        ]);

        $modelCleanClient->save([
            'nom' => $dataClient['nom'],
            'livre' => $dataClient['livre'],
            'date' => date('Y-m-d')
        ]);

        $modelClient->delete($idClient);
        $data = [
            'clientclean' => $modelCleanClient->findAll()
        ];

SELECT *
FROM `clientclean`
---
    public function listeCleanClient(){
        $model = new CleanClientModel();
        $data['clientclean'] = $model->findAll();